# Iris

### Introduction:

This exercise may seem a little bit strange, but keep doing it.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data).

### Step 3. Assign it to a variable called iris

In [4]:
filepath = 'C:/Users/tean.wu/Downloads/iris.data'
iris = pd.read_csv(filepath)

In [5]:
iris.head(3)

   5.1  3.5  1.4  0.2  Iris-setosa
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa

### Step 4. Create columns for the dataset

In [6]:
# 1. sepal_length (in cm)
# 2. sepal_width (in cm)
# 3. petal_length (in cm)
# 4. petal_width (in cm)
# 5. class
iris.columns = ['sepal_length (in cm)','sepal_width (in cm)','petal_length (in cm)','petal_width (in cm)','class']

In [7]:
iris.head(2)

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm),class
0,4.9,3.0,1.4,0.2,Iris-setosa
1,4.7,3.2,1.3,0.2,Iris-setosa

### Step 5.  Is there any missing value in the dataframe?

In [20]:
pd.notna(iris).sum(axis=0).sum()

745

In [27]:
(iris['class'] == np.nan).sum()

0

### Step 6.  Lets set the values of the rows 10 to 29 of the column 'petal_length' to NaN

In [29]:
iris['petal_length (in cm)'][10:30]=np.nan

E:\python3.6\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [30]:
iris['petal_length (in cm)'][10:30]

10   NaN
11   NaN
12   NaN
13   NaN
14   NaN
15   NaN
16   NaN
17   NaN
18   NaN
19   NaN
20   NaN
21   NaN
22   NaN
23   NaN
24   NaN
25   NaN
26   NaN
27   NaN
28   NaN
29   NaN
Name: petal_length (in cm), dtype: float64

### Step 7. Good, now lets substitute the NaN values to 1.0

In [37]:
iris.fillna(1.0,inplace=True)

In [38]:
iris.isna().sum()

sepal_length (in cm)    0
sepal_width (in cm)     0
petal_length (in cm)    0
petal_width (in cm)     0
class                   0
dtype: int64

### Step 8. Now let's delete the column class

In [39]:
del iris['class']

### Step 9.  Set the first 3 rows as NaN

In [41]:
iris.iloc[:4,:] = np.nan
iris.head(5)

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm)
0,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN
4,5.4,3.9,1.7,0.4

### Step 10.  Delete the rows that have NaN

In [44]:
iris.dropna(inplace=True)

In [45]:
iris.head(5)

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm)
4,5.4,3.9,1.7,0.4
5,4.6,3.4,1.4,0.3
6,5.0,3.4,1.5,0.2
7,4.4,2.9,1.4,0.2
8,4.9,3.1,1.5,0.1

### Step 11. Reset the index so it begins with 0 again

In [46]:
iris.reset_index(inplace=True)
iris.head()

,index,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm)
0,4,5.4,3.9,1.7,0.4
1,5,4.6,3.4,1.4,0.3
2,6,5.0,3.4,1.5,0.2
3,7,4.4,2.9,1.4,0.2
4,8,4.9,3.1,1.5,0.1

### BONUS: Create your own question and answer it.

In [47]:
iris.iloc[:2,:2]=np.nan
iris.head()

,index,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm)
0,NaN,NaN,3.9,1.7,0.4
1,NaN,NaN,3.4,1.4,0.3
2,6.0,5.0,3.4,1.5,0.2
3,7.0,4.4,2.9,1.4,0.2
4,8.0,4.9,3.1,1.5,0.1

In [49]:
iris.dropna(axis=1)

     sepal_width (in cm)  petal_length (in cm)  petal_width (in cm)
0                    3.9                   1.7                  0.4
1                    3.4                   1.4                  0.3
2                    3.4                   1.5                  0.2
3                    2.9                   1.4                  0.2
4                    3.1                   1.5                  0.1
..                   ...                   ...                  ...
140                  3.0                   5.2                  2.3
141                  2.5                   5.0                  1.9
142                  3.0                   5.2                  2.0
143                  3.4                   5.4                  2.3
144                  3.0                   5.1                  1.8

[145 rows x 3 columns]